app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.uniq.pluck('rating')
    rating_filter, rating_redirect = get_parameter(params[:ratings], 'rating', @all_ratings)
    sort_by, sort_redirect = get_parameter(params[:sort], 'sort', 'none')
    if rating_redirect or sort_redirect
      flash.keep
      redirect_to movies_path(:sort => sort_by, :ratings => Hash[rating_filter.collect { |v| [v, 1] }])
    end
    movie_afterSort = Movie.select_byRating(rating_filter)
---
SELECT DISTINCT rating FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date